<?xml version="1.0" encoding="UTF-8"?>
<policy>
	<general>
		<name>%PROD_NAME%%POLICY_LANGUAGE%%POLICY_LICENSE% v%version%</name>
		<enabled>true</enabled>
        <trigger>EVENT</trigger>
        <trigger_checkin>false</trigger_checkin>
        <trigger_enrollment_complete>false</trigger_enrollment_complete>
        <trigger_login>false</trigger_login>
        <trigger_logout>false</trigger_logout>
        <trigger_network_state_changed>false</trigger_network_state_changed>
        <trigger_startup>false</trigger_startup>
        <trigger_other>MunkiToolsCore-install</trigger_other>
		<frequency>Ongoing</frequency>
		<category>
			<name>%POLICY_CATEGORY%</name>
		</category>
	</general>
	<scope>
        <all_computers>true</all_computers>
	</scope>
	<package_configuration>
		<!--Package added by JSSImporter-->
	</package_configuration>
	<scripts>
		<!--Scripts added by JSSImporter-->
	</scripts>
	<self_service>
		<use_for_self_service>false</use_for_self_service>
	</self_service>
	<maintenance>
		<recon>true</recon>
	</maintenance>
</policy>
